{
  "en": [
    {
      "title": "When is the deadline for the exercises and the exam?",
      "text": [
        "The deadline for the exercises will be posted on Canvas.  The deadline for the exam is also on Canvas."
      ]
    },
    {
      "title": "How do I submit the exercises?",
      "text": [
        "The exercises are submitted through GitHub and marking them as done on Canvas. You can read more from <a href='/part0/general_info#submitting-exercises'>here</a>. "
      ]
    },
    {
      "title": "Do I have to submit each part to a separate repository?",
      "text": [
        "Most of the time, you will be. Each part has separate instructions and for many of the parts you will be given a starter repository."
      ]
    },
    {
      "title": "Can I just submit the exercise right at the end just before the submission?",
      "text": [
        "No. You will be expected to show your work as you go through by committing regularly and describing in your own words what the code is doing."
      ]
    },
    {
        "title": "I'm not sure how to fix ______, I need help!",
        "text": [
            "Many completely asynchronous classes are very hard because you don't always get the support when you need it.",
            "Here, the aim should be that you get just enough help to allow you to keep going. You can get that by messaging me or messaging the general forums in Discord.",
            "If for some reason I'm not responding, think pragamitically about the steps you can take.  How are you reproducing the issue? What do your console logs say? Have you used the debugger to look at what happens just before? Practicing all of these techniques will make you a better software developer in the end.",
            "The best thing you can do is to get <em>just enough</em> help to allow you to continue.  It's easy to become frustrated and to just want to finish, but that will not get you the learning and problem solving skills that most companies are looking for.",
            "Do yourself a favor and think about your learning as you are going through the course to maximize your potential"
        ]
    }
  ]
}
