{
  "en": {
    "mainTitle": "Deep Dive Into Modern Web Development",
    "intro": "Learn React, Redux, Node.js, MongoDB, GraphQL and TypeScript in one go! This course will introduce you to modern JavaScript-based web development. The main focus is on building single page applications with ReactJS that use REST APIs built with Node.js.",
    "current": [
      "The 2022 edition has started! Despite the year is soon over you can start now since the course continues at 2023, see <a href='/en/part0/general_info#continuing-the-course-at-year-2023'>this</a> for more details.",
      "You can discuss the course and related topics in our dedicated group on Discord <a target='_blank' href='https://study.cs.helsinki.fi/discord/join/fullstack'>https://study.cs.helsinki.fi/discord/join/fullstack</a> and on Telegram: <a target='_blank' href='https://t.me/fullstackcourse'>https://t.me/fullstackcourse</a>. Please join the conversation!"
    ],
    "telegram": "Telegram is a whatsapp / messenger-style discussion forum application that can be used with a browser, mobile devices, and Windows / Linux / OSX clients.",
    "notice": "NB: Inappropriate, degrading and discriminatory comments are strictly forbidden on the channel, and anyone who sends these types of messages will be permanently removed from the discussion.",
    "licence": [
      "Parts 0-8 and 13 of the course material is written by <a href='https://github.com/mluukkai'>Matti Luukkainen</a>. The content of part 9 is written by developers from <a href='https://www.terveystalo.com/fi/Yritystietoa/Terveystalo-tyontantajana/Digital-Health/'>Terveystalo</a>. Part 10 is written by <a href='https://github.com/Kaltsoon'>Kalle Ilves</a>. The content of part 11 is written by developers from <a href='https://www.smartly.io/'>Smartly</a> and part 12 is by <a href='https://github.com/jakousa'>Jami Kousa</a>. Numerous <a href='https://github.com/fullstack-hy2020/misc/blob/master/contributors.md'>people</a> have improved and corrected the material both in content and spelling. You can also make improvements to the course material yourself. The course webpage is designed and created by <a target='_blank' href='https://www.houston-inc.com/'>Houston inc</a>, who have also audited the content of the course material. Chinese translation by <a target='_blank' href='https://zhangwei.online/blog'>Zhang Wei</a>. Spanish translation by <a target='_blank' href='https://github.com/sebastiantorres86'>Sebastian Torres</a> and <a target='_blank' href='https://github.com/cynthiamv'>Cynthia Vico Vacca</a>.",
      "The course material is licensed under <a href='https://creativecommons.org/licenses/by-nc-sa/3.0/'>Creative Commons BY-NC-SA 3.0 license</a>, which means that you are free to use and distribute the material, as long as the names of the original authors are not removed. If you make changes to the material and want to distribute the modified version, it must be licensed under the same license. Using the material for commercial purposes is forbidden without permission."
    ],
    "university": "The University of Helsinki is the oldest and largest science university in Finland, with an international scientific community of 40,000 people.",
    "houston": "The Finnish Houston Inc. is an agile software company founded in 2003. We design and implement customized digital services for our business.",
    "contacts": ["Full stack open 2022", "matti.luukkainen@helsinki.fi"],
    "licenced": "The material is licensed under the Creative Commons BY-NC-SA 3.0 License."
  },
  "es": {
    "mainTitle": "Profundización en el desarrollo web moderno.",
    "intro": "¡Aprenda React, Redux, Node.js, MongoDB, GraphQL y TypeScript de una sola vez! Este curso le presentará el desarrollo web moderno basado en JavaScript. El enfoque principal es crear aplicaciones de una sola página con ReactJS que usan REST API creadas con Node.js.",
    "current": [
      "<a href='https://github.com/fullstack-hy2020/fullstack-hy2020.github.io/issues/1164'>Looking for contributors for the Spanish translation</a>",
      "Puede discutir el curso y temas relacionados en nuestro grupo dedicado en Telegram: <a target='_blank' href='https://t.me/fullstackcourse'>https://t.me/fullstackcourse</a>. ¡Únase a la conversación!"
    ],
    "telegram": "Telegram es una aplicación de foro de discusión estilo whatsapp/messenger que se puede usar con un navegador, dispositivos móviles y clientes Windows/Linux/OSX.",
    "notice": "NB: Los comentarios inapropiados, degradantes y discriminatorios están estrictamente prohibidos en el canal, y cualquiera que envíe este tipo de mensajes será eliminado permanentemente de la discusión.",
    "licence": [
      "Las partes 0 a 8 del material del curso están escritas por <a href='https://github.com/mluukkai'>Matti Luukkainen</a>. El contenido de la parte 9 está escrito por desarrolladores de <a href='https://www.terveystalo.com/fi/Yritystietoa/Terveystalo-tyontantajana/Digital-Health/'>Terveystalo</a>. La parte 10 está escrita por <a href='https://github.com/Kaltsoon'>Kalle Ilves</a>. Numerosas <a href='https://github.com/fullstack-hy2020/misc/blob/master/contributors.md'>personas</a> han mejorado y corregido el material tanto en contenido como en ortografía. También puede realizar mejoras en el material del curso usted mismo. La página web del curso está diseñada y creada por <a target='_blank' href='https://www.houston-inc.com/'>Houston inc</a>, que también han auditado el contenido del material del curso. Traducción al chino de <a target='_blank' href='https://zhangwei.online/blog'>Zhang Wei</a>. Traducción al español de <a target='_blank' href='https://github.com/sebastiantorres86'>Sebastian Torres</a> y <a target='_blank' href='https://github.com/cynthiamv'>Cynthia Vico Vacca</a> con el apoyo de <a target='_blank' href='https://frontend.cafe/'>FrontendCafé</a>",
      "El material del curso tiene licencia de <a href='https://creativecommons.org/licenses/by-nc-sa/3.0/'>licencia Creative Commons BY-NC-SA 3.0</a>, lo que significa que son libres de usar y distribuir el material, siempre que no se eliminen los nombres de los autores originales. Si realiza cambios en el material y desea distribuir la versión modificada, debe tener la misma licencia. El uso del material para con fines comerciales está prohibido sin permiso."
    ],
    "university": "La Universidad de Helsinki es la universidad de ciencias más grande y antigua de Finlandia, con una comunidad científica internacional de 40.000 personas.",
    "houston": "The Finnish Houston Inc. es una empresa de software ágil fundada en 2003. Diseñamos e implementamos servicios digitales personalizados para nuestro negocio.",
    "contacts": ["Full Stack Open 2022", "matti.luukkainen@helsinki.fi"],
    "licensed": "El material está sujeto a la licencia Creative Commons BY-NC-SA 3.0."
  }
}
