{
  "en": {
    "mainTitle": "Deep Dive Into Modern Web Development",
    "intro": "Learn React, Redux, Node.js, MongoDB, GraphQL and TypeScript in one go! This course will introduce you to modern JavaScript-based web development. The main focus is on building single page applications with ReactJS that use REST APIs built with Node.js.",
    "current": [
      "Welcome to COMP 227!  As I go through the rest of the site, you will be noticing changes.  Please be patient with me as we make all of those changes happen",
      "You can discuss the course and related topics in our dedicated group on <a target='_blank' href='https://discord.gg/VRUKRxCJ95'>Discord</a> and via Canvas."
    ],
    "telegram": "",
    "notice": "NB: Inappropriate, degrading and discriminatory comments are strictly forbidden on the channel, and anyone who sends these types of messages will be permanently removed from the discussion.",
    "licence": [
      "This course has been modified from its original form and tailored specifically for use at the University of the Pacific by <a href='https://github.com/onzfonz'>Osvaldo Jiménez</a>.  Please make sure that if you are in the course that you follow always what is on the comp227 site (make sure it points to the comp227.djosv.com base URL).",
      "Parts 0-8 and 13 of the course material were originally authored by <a href='https://github.com/mluukkai'>Matti Luukkainen</a>. The content of part 9 was originally written by developers from <a href='https://www.terveystalo.com/fi/Yritystietoa/Terveystalo-tyontantajana/Digital-Health/'>Terveystalo</a>. Part 10 was originally written by <a href='https://github.com/Kaltsoon'>Kalle Ilves</a>. The content of part 11 was originally written by developers from <a href='https://www.smartly.io/'>Smartly</a> and part 12 was by <a href='https://github.com/jakousa'>Jami Kousa</a>. Numerous people have improved and corrected the material both in content and spelling. You can also make improvements to the course material yourself. The course webpage is designed and created by <a target='_blank' href='https://www.houston-inc.com/'>Houston inc</a>, who have also audited the content of the course material. Spanish translation originally by <a target='_blank' href='https://github.com/sebastiantorres86'>Sebastian Torres</a> and <a target='_blank' href='https://github.com/cynthiamv'>Cynthia Vico Vacca</a>.",
      "The course material is licensed under <a href='https://creativecommons.org/licenses/by-nc-sa/3.0/'>Creative Commons BY-NC-SA 3.0 license</a>, which means that you are free to use and distribute the material, as long as the names of the original authors are not removed. If you make changes to the material and want to distribute the modified version, it must be licensed under the same license. Using the material for commercial purposes is forbidden without permission."
    ],
    "university": "The University of Helsinki is the oldest and largest science university in Finland, with an international scientific community of 40,000 people.",
    "houston": "The Finnish Houston Inc. is an agile software company founded in 2003. We design and implement customized digital services for our business.",
    "contacts": ["COMP 227", "ojimenez AT pacific DOT edu"],
    "licenced": "The material is licensed under the Creative Commons BY-NC-SA 3.0 License."
  }
}
