{
  "en": [
    {
      "image": "Juha_Tauriainen.jpg",
      "companyLogo": "houston.svg",
      "text": [
        "My role at Houston concentrates on Frontend-development. We use a whole spectrum of technologies and libraries, including those taught in this course. As a consulting house we help our customers and partners to achieve better results through better quality. As well as the code, we bring the best practices of the field and help our customers to succeed.",
        "Working at Houston is awesome because of multiple reasons. The most I like that the employees are always number one. The ideas, suggestions and opinions of the staff are heard and reacted to. For example Houston gave me their full support to starting a mentorship program. We help people from different fields with programming, guide them to best practices and aim to get them to the business. This has taught both me and Houston very much. I get a huge kick out of helping others – no matter if they are customers, work mates or students."
      ],
      "name": "Juha Tauriainen",
      "title": "Senior Consultant"
    },
    {
      "image": "burcu_aybak.jpg",
      "companyLogo": "unity.svg",
      "text": [
        "I am working at Unity as a Full-stack Software Engineer and have ten years of experience in software development including e.g. web applications, command and control systems and communication systems.",
        "I love being in software engineering because it is a combination of intelligent problem solving and creative work. Sometimes it makes me feel like I am a superhero! Then again there are always new things and subjects to learn and you get paid to do what you enjoy with people you like - work in engineering is fun! Our industry and customers are fun (games!) and it is great to do work that helps our customers to make a living with what they love.",
        "I like working at Unity because the work allows me to work with excellent colleagues and different personalities from all over the world who are also very good at their jobs. It is a perfect place to learn new technologies and explore new areas. Unity is a perfect workplace for me in ways that I can’t explain in just a few sentences."
      ],
      "name": "Burcu Aybak",
      "title": "Software Engineer"
    },
    {
      "image": "Tuukka_Peuraniemi.jpg",
      "companyLogo": "terveystalo.svg",
      "text": [
        "I have many years of experience on health technologies. I ended up as a software developer after a few twists and turns. I started out as a pharmacist. Then I graduated as a Master of Computer Science and proceeded to work as a development director and later as a software developer.",
        "I enjoy working at Terveystalo, because here you have a say on the technologies we use and which projects you want to take part on. Due to my role and my experience I get to take part on starting and developing different new services. Right now I develop a new mobile application, which will see the light of day among customers in the near future. ",
        "In the future I want to continue to advance in my job and to keep learning. Working in  multivendor-projects with experienced colleagues maintains and  develops my skills.",
        "I believe Terveystalo will keep offering new meaningful projects in the future."
      ],
      "name": "Tuukka Peuraniemi",
      "title": "Sovelluskehittäjä ja digitaalinen moniosaaja"
    },
    {
      "image": "kristiina_ronnberg.jpg",
      "companyLogo": "konecranes.svg",
      "text": [
        "In a field where continuous learning is almost vital, I have been lucky to get to work with the latest technologies and experienced colleagues. In my role at Konecranes I get to work in an international environment and develop solutions which bring the benefits of industrial internet to the everyday lives of our customers. The technology palette we use is rich, and the development methods have become even more agile – the contents covered by this course are also present in our work.",
        "My road to IT was not the most straight forwards. I studied as a Finnish teacher, but ended up, after continuing my education, shifting careers to this different world where language and  writing skills and creativity are emphazised as well. Partly due to my background I have been delighted, that at Konecrass the different backgrounds and skills of the employees are appreciated and their advancement is supported. In this kind of environment the new field and developing in it has felt natural and motivating."
      ],
      "name": "Kristiina Rönnberg",
      "title": "Software Engineer"
    },
    {
      "image": "Juho_Kyrola.jpg",
      "companyLogo": "elisa.svg",
      "text": [
        "I work at Elisa as a software developer and study IT at Aalto University. I am at the end of my studies, and will soon begin my thesis. I have also completed courses and worked here at the same time. I ended up at Elisa because of a recommendation from a friend, he told me, that this is a good company to work for and urged me to apply.",
        "Previously I worked for a couple other companies for roughly 1.5 years as a developer. Programming has been a hobby of mine since childhood, and I have always known computers are my thing. My first programming language was Java.",
        "I work at Elisa Automate working on an optimization platform for mobile networks. I work with the platform itself, not the optimization algorithms. Technologies I have used for projects include Python, React, Elasticsearch and Docker, and for me the best is exactly this – full stack programming. You are not a front end hero, but you get to do it all. It keeps the passion up. The projects are also meaningful for me. It’s fun that we are the pioneers of the field and not just doing our own versions of something already existing.",
        "In the beginning it was a bit difficult to get the hang of the project I work on, but bit by bit I got there. It has been really motivating, that this is something else than just creating a “normal” website.  It is easy to immerse yourself with the work alone, but it is important to keep the importance of team work in mind. Without teamwork the work proceeds slowly and you might end up doing the wrong thing. For new employees (both trainees and more experienced coders) it would be beneficial to do for example parner coding in the beginning.",
        "Beforehand I was interested to know, wether the culture in a large company would be very stuck up, but I was pleasantly surprised that my team is so agile. Advancing the work does not feel like getting blood from a stone, but is almost a walk in the park. Before starting my job I thought I would easily end up tighly siloed, but in reality I have been able to do diversely different things. You just have to ask for diverse things to do yourself! You have to take charge of your own motivation.",
        "The interview had two parts. First I met my future boss, who determined wha kind of person I am. On a different day there was a technical interview, where my competence was tested through chatting and small exercises. Thjroughout the process you could clearly see the humane side, they did not only care about how good a coder you are, but also who you are as a person. The application process did not give me the feeling of being examined, but that we were looking for a common ground, and I got a feel of who my future teammates are.",
        "The corporate culture here meets my expectations, and it is easy to arrange your job around your life. Communication also works well, things are discussed enough within the company, and I have not gotten the feeling that there is this shady “upper floor” where everything is decided. Of course you don’t always know what is being done in other teams, but that seems to be the same in every other big company.",
        "There are enough opportunities to advance and learn, and you get to use your skills. Your manager and your teams scrum master proposes different things, now I am going to React Finland event. All in all, it’s fun rather than annoying to come to work everyday."
      ],
      "name": "Juho Kyrölä",
      "title": "Software Developer"
    },
    {
      "image": "holly_gibson_sq.jpg",
      "companyLogo": "smartly_io.svg",
      "text": [
        "I’m working as a software developer at Smartly.io, building our image and video templating tools and creating a beautiful and powerful experience for designers who make visual media. Our team works with JavaScript, React, and Node.js. From the first moment, I loved the culture at Smartly.io especially our value of being Humble Hungry Hunters. We have no egos here, and we’re humble.",
        "At the same time, we’re lifelong learners, hunting for new knowledge, and constantly leveling up. I have a bit of an alternative background. I used to work in IT at a university and took an online PHP class to improve my technical skills. I had the worst experience and thought I’d never become a developer. I went on to work at nonprofits in marketing, website management, and graphic design. My career in software development started when I took part in an intensive Ruby on Rails bootcamp. It was one of the hardest things I had done so far, but it landed me a job as the first—and only—developer in an ed-tech startup. As I was in charge of everything from th servers to the database to the web app, I needed to learn lots of new skills very quickly. I even rebuilt our server in the middle of a Finnish forest during my holiday after it got hacked! Having so much responsibility grew my confidence as a professional developer. Since then, I have worked in multiple companies with different tech stacks and frameworks and advanced to a team lead position.",
        "I’m one part engineer and one part artist. Coding allows me to use both halves of my brain: the logical part that loves puzzles and problem solving, and the artistic one that enjoys creating beautiful and functional user interfaces. There’s also a profoundly human element to developing software that I like. When we are building creative tools, we need to have empathy and understand our customers’ needs to succeed in producing something easy and powerful to use."
      ],
      "name": "Holly Gibson",
      "title": "Software Developer"
    }
  ],
  "es": [
    {
      "image": "Juha_Tauriainen.jpg",
      "companyLogo": "houston.svg",
      "text": [
        "Mi función en Houston se concentra en el desarrollo del frontend. Utilizamos una amplia gama de tecnologías y bibliotecas, incluidas las que se enseñan en este curso. Como empresa de consultoría, ayudamos a nuestros clientes y socios a lograr mejores resultados a través de una mejor calidad. Así como el código, traemos las mejores prácticas del campo y ayudamos a nuestros clientes a tener éxito.",
        "Trabajar en Houston es fantástico por varias razones. Lo que más me gusta es que los empleados son siempre el número uno. Las ideas, sugerencias y opiniones del personal son escuchadas y reaccionadas. Por ejemplo, Houston me brindó todo su apoyo para iniciar una tutoría Ayudamos a personas de diferentes campos con la programación, los guiamos hacia las mejores prácticas y nuestro objetivo es llevarlos al negocio. Esto nos ha enseñado mucho a mí y a Houston. Me encanta ayudar a los demás, sin importar si clientes, compañeros de trabajo o estudiantes."
      ],
      "name": "Juha Tauriainen",
      "title": "Consultor senior"
    },
    {
      "image": "burcu_aybak.jpg",
      "companyLogo": "unity.svg",
      "text": [
        "Trabajo en Unity como ingeniero de software full stack y tengo diez años de experiencia en el desarrollo de software, que incluyen, por ejemplo, aplicaciones web, sistemas de comando y control y sistemas de comunicación.",
        "Me encanta estar en ingeniería de software porque es una combinación de resolución inteligente de problemas y trabajo creativo. ¡A veces me hace sentir como un superhéroe! Por otra parte, siempre hay cosas y temas nuevos que aprender y te pagan por hacer lo que quieres. disfruta con la gente que te gusta - ¡trabajar en ingeniería es divertido! Nuestra industria y los clientes son divertidos (¡juegos!) y es genial hacer un trabajo que ayude a nuestros clientes a ganarse la vida con lo que aman.",
        "Me gusta trabajar en Unity porque el trabajo me permite trabajar con excelentes colegas y diferentes personalidades de todo el mundo que también son muy buenos en sus trabajos. Es un lugar perfecto para aprender nuevas tecnologías y explorar nuevas áreas. Unity es un lugar de trabajo perfecto para mí de una manera que no puedo explicar en unas pocas frases."
      ],
      "name": "Burcu Aybak",
      "title": "Ingeniero de software"
    },
    {
      "image": "Tuukka_Peuraniemi.jpg",
      "companyLogo": "terveystalo.svg",
      "text": [
        "Tengo muchos años de experiencia en tecnologías de la salud. Terminé como desarrollador de software después de algunos giros y vueltas. Comencé como farmacéutico. Luego me gradué como Maestría en Ciencias de la Computación y procedí a trabajar como director de desarrollo y más tarde como desarrollador de software.",
        "Disfruto trabajando en Terveystalo, porque aquí tienes voz sobre las tecnologías que usamos y en qué proyectos quieres participar. Debido a mi rol y mi experiencia puedo participar en la puesta en marcha y desarrollo de diferentes nuevos servicios. Ahora mismo Desarrollo una nueva aplicación móvil, que verá la luz entre los clientes en un futuro próximo.",
        "En el futuro quiero seguir avanzando en mi trabajo y seguir aprendiendo. Trabajar en proyectos de múltiples proveedores con colegas experimentados mantiene y desarrolla mis habilidades.",
        "Creo que Terveystalo seguirá ofreciendo nuevos proyectos significativos en el futuro."
      ],
      "name": "Tuukka Peuraniemi",
      "title": "Desarrollador de aplicaciones y multi-experto digital"
    },
    {
      "image": "kristiina_ronnberg.jpg",
      "companyLogo": "konecranes.svg",
      "text": [
        "En un campo donde el aprendizaje continuo es casi vital, he tenido la suerte de poder trabajar con las últimas tecnologías y colegas experimentados. En mi puesto en Konecranes puedo trabajar en un entorno internacional y desarrollar soluciones que aportan los beneficios de Internet industrial a la vida cotidiana de nuestros clientes. La paleta tecnológica que utilizamos es rica, y los métodos de desarrollo se han vuelto aún más ágiles, los contenidos cubiertos por este curso también están presentes en nuestro trabajo.",
        "Mi camino hacia la tecnología de la información no fue el más sencillo. Estudié como profesora de finlandés, pero terminé, después de continuar mi educación, cambiando mi carrera hacia este mundo diferente donde también se enfatizan las habilidades de lenguaje y escritura y la creatividad. Antecedentes Estoy encantado de que en Konecrass se aprecien los diferentes antecedentes y habilidades de los empleados y se apoye su avance. En este tipo de entorno, el nuevo campo y el desarrollo en él se ha sentido natural y motivador."
      ],
      "name": "Kristiina Rönnberg",
      "title": "Ingeniero de software"
    },
    {
      "image": "Juho_Kyrola.jpg",
      "companyLogo": "elisa.svg",
      "text": [
        "Trabajo en Elisa como desarrolladora de software y estudio TI en la Universidad Aalto. Estoy terminando mis estudios y pronto comenzaré mi tesis. También he completado cursos y trabajé aquí al mismo tiempo. Terminé en Elisa debido a una recomendación de un amigo, me dijo, que este es un buen lugar para trabajar y me instó a aplicar.",
        "Anteriormente trabajé para un par de otras empresas durante aproximadamente 1,5 años como desarrollador. La programación ha sido un pasatiempo mío desde la infancia, y siempre supe que lo mío son las computadoras. Mi primer lenguaje de programación fue Java.",
        "Trabajo en Elisa Automate trabajando en una plataforma de optimización para redes móviles. Trabajo con la plataforma en sí, no con los algoritmos de optimización. Las tecnologías que he usado para proyectos incluyen Python, React, Elasticsearch y Docker, y para mí lo mejor es exactamente esto - programación de pila completa. No eres un héroe de front-end, pero puedes hacerlo todo. Mantiene la pasión. Los proyectos también son significativos para mí. Es divertido que seamos los pioneros en el campo y no solo propias versiones de algo ya existente.",
        "Al principio fue un poco difícil entender el proyecto en el que estoy trabajando, pero poco a poco llegué allí. Ha sido muy motivador, que esto sea algo más que crear un sitio web 'normal'. Es fácil sumergirse solo en el trabajo, pero es importante tener en cuenta la importancia del trabajo en equipo. Sin trabajo en equipo, el trabajo avanza lentamente y podría terminar haciendo algo incorrecto. Para los nuevos empleados (tanto aprendices como codificadores más experimentados) sería beneficioso hacer, por ejemplo, codificación de pares al principio.",
        "De antemano me interesaba saber si la cultura en una gran empresa estaría muy estancada, pero me sorprendió gratamente que mi equipo sea tan ágil. Avanzar en el trabajo no se siente como sacar sangre de una piedra, pero es casi un caminar en el parque. Antes de comenzar mi trabajo pensé que fácilmente terminaría encerrado, pero en realidad he podido hacer cosas muy diferentes. ¡Solo tienes que pedir diversas cosas para hacer tú mismo! Tienes que hacerte cargo de tu propia motivación.",
        "La entrevista tuvo dos partes. Primero conocí a mi futuro jefe, quien determinó qué tipo de persona soy. En otro día hubo una entrevista técnica, donde se puso a prueba mi competencia a través de charlas y pequeños ejercicios. A lo largo del proceso se podía claramente Mira el lado humano, no solo se preocuparon por lo buen codificador que eres, sino también por quién eres como persona. El proceso de solicitud no me dio la sensación de estar siendo examinado, sino que estábamos buscando un terreno común, y tengo una idea de quiénes son mis futuros compañeros.",
        "La cultura corporativa aquí cumple con mis expectativas y es fácil organizar su trabajo en torno a su vida. La comunicación también funciona bien, las cosas se discuten lo suficiente dentro de la empresa y no tengo la sensación de que exista este 'piso superior' turbio donde todo se decide. por supuesto que no siempre saben lo que se está haciendo en otros equipos, pero que parece ser la misma en todas las otras compañías grandes.",
        "Hay suficientes oportunidades para avanzar y aprender, y puedes usar tus habilidades. Tu manager y el scrum master de tu equipo proponen cosas diferentes, ahora voy al evento React Finland. En general, es divertido en lugar de molesto venir a trabajar todos los días."
      ],
      "name": "Juho Kyrölä",
      "title": "Desarrollador de software"
    },
    {
      "image": "holly_gibson_sq.jpg",
      "companyLogo": "smartly_io.svg",
      "text": [
        "Trabajo como desarrollador de software en Smartly.io, construyendo nuestras herramientas de creación de plantillas de imágenes y videos y creando una experiencia hermosa y poderosa para los diseñadores que crean medios visuales. Nuestro equipo trabaja con JavaScript, React y Node.js. En el primer momento, me encantó la cultura en Smartly.io, especialmente nuestro valor de ser Humble Hungry Hunters. No tenemos egos aquí, y somos humildes.",
        "¡Incluso reconstruí nuestro servidor en medio de un bosque finlandés durante mis vacaciones después de que fue pirateado! Tener tanta responsabilidad hizo crecer mi confianza como desarrollador profesional. Desde entonces, he trabajado en varias empresas con diferentes tipos de tecnología y marcos y he avanzado a una posición de líder de equipo ",
        "Soy en parte ingeniero y en parte artista. La codificación me permite usar ambas mitades de mi cerebro: la parte lógica que ama los acertijos y la resolución de problemas, y la parte artística que disfruta creando interfaces de usuario hermosas y funcionales. También hay un profundo elemento humano para desarrollar software que me guste. Cuando estamos construyendo herramientas creativas, necesitamos tener empatía y comprender las necesidades de nuestros clientes para tener éxito en la producción de algo fácil y poderoso de usar."
      ],
      "name": "Holly Gibson",
      "title": "Desarrollador de software"
    }
  ]
}
